; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=200, out_folder=./training, instance_id=8, seed=2032, goal_proportion=0.03

(define (problem blocksworld-08)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 - object)
 (:init 
    (arm-empty)
    (clear b143)
    (on b143 b63)
    (on b63 b14)
    (on b14 b23)
    (on b23 b178)
    (on-table b178)
    (clear b8)
    (on b8 b37)
    (on b37 b198)
    (on b198 b10)
    (on b10 b74)
    (on b74 b26)
    (on b26 b76)
    (on b76 b121)
    (on b121 b116)
    (on-table b116)
    (clear b24)
    (on-table b24)
    (clear b160)
    (on b160 b163)
    (on b163 b33)
    (on b33 b12)
    (on-table b12)
    (clear b73)
    (on b73 b159)
    (on b159 b17)
    (on-table b17)
    (clear b147)
    (on b147 b84)
    (on b84 b82)
    (on-table b82)
    (clear b90)
    (on b90 b134)
    (on b134 b55)
    (on b55 b124)
    (on-table b124)
    (clear b176)
    (on b176 b43)
    (on-table b43)
    (clear b175)
    (on b175 b57)
    (on-table b57)
    (clear b135)
    (on b135 b190)
    (on-table b190)
    (clear b122)
    (on-table b122)
    (clear b83)
    (on b83 b20)
    (on b20 b136)
    (on b136 b52)
    (on-table b52)
    (clear b137)
    (on b137 b58)
    (on b58 b79)
    (on b79 b7)
    (on b7 b25)
    (on b25 b131)
    (on b131 b66)
    (on b66 b185)
    (on b185 b4)
    (on b4 b94)
    (on b94 b155)
    (on b155 b139)
    (on b139 b111)
    (on b111 b128)
    (on b128 b194)
    (on b194 b189)
    (on b189 b104)
    (on b104 b95)
    (on b95 b42)
    (on b42 b125)
    (on b125 b179)
    (on-table b179)
    (clear b127)
    (on b127 b174)
    (on-table b174)
    (clear b16)
    (on b16 b50)
    (on-table b50)
    (clear b103)
    (on-table b103)
    (clear b30)
    (on b30 b110)
    (on b110 b105)
    (on b105 b193)
    (on b193 b144)
    (on b144 b18)
    (on-table b18)
    (clear b81)
    (on-table b81)
    (clear b40)
    (on-table b40)
    (clear b123)
    (on b123 b195)
    (on b195 b107)
    (on b107 b165)
    (on b165 b67)
    (on b67 b100)
    (on b100 b177)
    (on b177 b138)
    (on-table b138)
    (clear b3)
    (on b3 b157)
    (on b157 b96)
    (on b96 b48)
    (on b48 b184)
    (on b184 b69)
    (on b69 b44)
    (on b44 b158)
    (on-table b158)
    (clear b49)
    (on b49 b27)
    (on b27 b60)
    (on-table b60)
    (clear b45)
    (on-table b45)
    (clear b153)
    (on b153 b130)
    (on b130 b112)
    (on b112 b132)
    (on b132 b71)
    (on-table b71)
    (clear b106)
    (on b106 b97)
    (on-table b97)
    (clear b167)
    (on b167 b75)
    (on b75 b80)
    (on-table b80)
    (clear b141)
    (on b141 b93)
    (on-table b93)
    (clear b120)
    (on-table b120)
    (clear b5)
    (on-table b5)
    (clear b99)
    (on b99 b88)
    (on b88 b85)
    (on b85 b191)
    (on b191 b98)
    (on b98 b78)
    (on b78 b148)
    (on b148 b188)
    (on b188 b64)
    (on b64 b21)
    (on b21 b28)
    (on-table b28)
    (clear b114)
    (on b114 b115)
    (on b115 b101)
    (on-table b101)
    (clear b19)
    (on b19 b126)
    (on b126 b68)
    (on b68 b199)
    (on b199 b15)
    (on b15 b117)
    (on b117 b113)
    (on b113 b89)
    (on-table b89)
    (clear b47)
    (on-table b47)
    (clear b181)
    (on b181 b61)
    (on-table b61)
    (clear b56)
    (on b56 b142)
    (on b142 b154)
    (on b154 b164)
    (on-table b164)
    (clear b171)
    (on b171 b13)
    (on-table b13)
    (clear b29)
    (on b29 b180)
    (on b180 b6)
    (on b6 b146)
    (on b146 b129)
    (on-table b129)
    (clear b187)
    (on b187 b2)
    (on b2 b109)
    (on-table b109)
    (clear b1)
    (on-table b1)
    (clear b65)
    (on b65 b161)
    (on b161 b38)
    (on b38 b133)
    (on b133 b200)
    (on b200 b34)
    (on b34 b102)
    (on b102 b152)
    (on b152 b51)
    (on b51 b86)
    (on b86 b35)
    (on b35 b182)
    (on b182 b87)
    (on b87 b91)
    (on b91 b32)
    (on b32 b54)
    (on b54 b162)
    (on b162 b72)
    (on b72 b140)
    (on b140 b36)
    (on-table b36)
    (clear b156)
    (on b156 b22)
    (on b22 b183)
    (on b183 b186)
    (on-table b186)
    (clear b150)
    (on-table b150)
    (clear b173)
    (on-table b173)
    (clear b70)
    (on b70 b108)
    (on b108 b62)
    (on b62 b77)
    (on b77 b166)
    (on b166 b192)
    (on b192 b39)
    (on b39 b118)
    (on b118 b53)
    (on-table b53)
    (clear b11)
    (on b11 b92)
    (on b92 b168)
    (on-table b168)
    (clear b197)
    (on-table b197)
    (clear b151)
    (on b151 b145)
    (on-table b145)
    (clear b41)
    (on b41 b170)
    (on b170 b46)
    (on-table b46)
    (clear b59)
    (on-table b59)
    (clear b196)
    (on b196 b31)
    (on b31 b119)
    (on b119 b169)
    (on b169 b172)
    (on b172 b149)
    (on b149 b9)
    (on-table b9))
 (:goal  (and 
    (clear b4)
    (on-table b4)
    (clear b6)
    (on b6 b1)
    (on-table b1)
    (clear b5)
    (on-table b5)
    (clear b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b3 b157)
   deleted: (on b3 b157) (clear b3) (arm-empty)
   added: (holding b3) (clear b157)
   goals met: 3 of 10
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 10
3. (unstack b137 b58)
   deleted: (on b137 b58) (clear b137) (arm-empty)
   added: (holding b137) (clear b58)
   goals met: 4 of 10
4. (putdown b137)
   deleted: (holding b137)
   added: (clear b137) (arm-empty) (on-table b137)
   goals met: 4 of 10
5. (unstack b187 b2)
   deleted: (on b187 b2) (clear b187) (arm-empty)
   added: (holding b187) (clear b2)
   goals met: 5 of 10
6. (putdown b187)
   deleted: (holding b187)
   added: (clear b187) (arm-empty) (on-table b187)
   goals met: 5 of 10
7. (unstack b29 b180)
   deleted: (on b29 b180) (clear b29) (arm-empty)
   added: (holding b29) (clear b180)
   goals met: 5 of 10
8. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 5 of 10
9. (unstack b180 b6)
   deleted: (on b180 b6) (clear b180) (arm-empty)
   added: (holding b180) (clear b6)
   goals met: 6 of 10
10. (putdown b180)
   deleted: (holding b180)
   added: (clear b180) (arm-empty) (on-table b180)
   goals met: 6 of 10
11. (unstack b58 b79)
   deleted: (on b58 b79) (clear b58) (arm-empty)
   added: (holding b58) (clear b79)
   goals met: 6 of 10
12. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 6 of 10
13. (unstack b79 b7)
   deleted: (on b79 b7) (clear b79) (arm-empty)
   added: (holding b79) (clear b7)
   goals met: 6 of 10
14. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 6 of 10
15. (unstack b7 b25)
   deleted: (on b7 b25) (clear b7) (arm-empty)
   added: (holding b7) (clear b25)
   goals met: 6 of 10
16. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 6 of 10
17. (unstack b25 b131)
   deleted: (on b25 b131) (clear b25) (arm-empty)
   added: (holding b25) (clear b131)
   goals met: 6 of 10
18. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 6 of 10
19. (unstack b131 b66)
   deleted: (on b131 b66) (clear b131) (arm-empty)
   added: (holding b131) (clear b66)
   goals met: 6 of 10
20. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 6 of 10
21. (unstack b66 b185)
   deleted: (on b66 b185) (clear b66) (arm-empty)
   added: (holding b66) (clear b185)
   goals met: 6 of 10
22. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 6 of 10
23. (unstack b185 b4)
   deleted: (on b185 b4) (clear b185) (arm-empty)
   added: (holding b185) (clear b4)
   goals met: 7 of 10
24. (putdown b185)
   deleted: (holding b185)
   added: (clear b185) (arm-empty) (on-table b185)
   goals met: 7 of 10
25. (unstack b4 b94)
   deleted: (on b4 b94) (clear b4) (arm-empty)
   added: (holding b4) (clear b94)
   goals met: 6 of 10
26. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 8 of 10
27. (unstack b2 b109)
   deleted: (on b2 b109) (clear b2) (arm-empty)
   added: (holding b2) (clear b109)
   goals met: 7 of 10
28. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 9 of 10
29. (unstack b6 b146)
   deleted: (on b6 b146) (clear b6) (arm-empty)
   added: (holding b6) (clear b146)
   goals met: 8 of 10
30. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 10 of 10
